# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-OBB-KHM: Optimized for Khmer text line detection (OBB)
# Over yolo26-obb.yaml:
#   + C2PSA at P4 neck — cheap coarser context (40x40=1600 tokens) for wide/long Khmer lines
#   + C2PSA at P3 neck — fine horizontal text-line context (80x80=6400 tokens)
#   + SCDown for P3→P4 bottom-up — depthwise-separable stride-2, cheaper than Conv & preserves detail
#   + reg_max=2 — better OBB angle/coord regression for thin/slanted lines; linear cost in head only
# Task docs: https://docs.ultralytics.com/tasks/obb

# Parameters
nc: 1      # number of classes
end2end: True
reg_max: 2  # 1→2: better OBB precision for thin/slanted lines; cost only in detection head
scales:     # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (identical to yolo26-obb.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]       # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2, [512, True]]              # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]             # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]             # 8-P5/32
  - [-1, 1, SPPF, [1024, 5, 3, True]]       # 9-P5/32
  - [-1, 2, C2PSA, [1024]]                  # 10-P5/32

# Head — standard P3/P4/P5 FPN + C2PSA at P3 for text-line context
head:
  # --- Top-down: P5 → P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                     # 12: cat backbone P4
  - [-1, 2, C3k2, [512, True]]                    # 13-P4/16
  - [-1, 1, C2PSA, [512]]                         # 14-P4/16 (coarse line context for wide Khmer lines)

  # --- Top-down: P4 → P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                     # 16: cat backbone P3
  - [-1, 2, C3k2, [256, True]]                    # 17-P3/8
  - [-1, 1, C2PSA, [256]]                         # 18-P3/8 (fine horizontal text-line context)

  # --- Bottom-up: P3 → P4 ---
  - [-1, 1, SCDown, [256, 3, 2]]                  # 19 (cheaper than Conv, preserves line detail better)
  - [[-1, 14], 1, Concat, [1]]                    # 20: cat head P4 (attended)
  - [-1, 2, C3k2, [512, True]]                    # 21-P4/16

  # --- Bottom-up: P4 → P5 ---
  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 10], 1, Concat, [1]]                    # 23: cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]        # 24-P5/32

  - [[18, 21, 24], 1, OBB26, [nc, 1]]             # OBB26(P3, P4, P5)
